import assignPrevAndNext from "@utils/assignPrevAndNext";
const data = assignPrevAndNext([
  {
    name: "potassium",
    text: `კალიუმის 98% ჩვენ სხეულში არის უჯრედებში, აქედან 80% არის ჩონჩხის
          კუნთებში, 20% კი, ძვლებში, ერითროციტებში და ღვიძლში. კალიუმით მდიდარი
          კვება ამცირებს არტერიულ წნევას, ის ასევე ამცირებს ინსულტის ალბათობას
          27%-ით. კალიუმი ორგანიზმს ეხმარება თავიდან აირიდოს ოსტეოპოროზი და
          თირკმლის კენჭები. რეკომენდირებულია, რომ ყოველ დღე მივიღოთ
          #st 3,500 - 4,700 #st მგ კალიუმი.`,
    foods: [
      { name: "ორაგული", elem: 987, g: 154 },
      { name: "ლობიო", elem: 987, g: 179 },
      { name: "ავოკადო", elem: 345, g: 68 },
      { name: "კარტოფილი", elem: 564, g: 167 },
      { name: "ჭარხალი", elem: 517, g: 170 },
      { name: "ბროწეული", elem: 658, g: 282 },
    ],
  },
  {
    name: "calcium",
    text: `
    კალციუმის 90% ჩვენ ძვლებში და კბილებშია. სისხლში კი ის გამოიყენება ნერვული სიგნალების გასაგზავნად, და ჰორმონების გამოსაყოფად როგორიცაა ინსულინი. როდესაც საკმარის კალციუმს არ ვიღებთ, ჩვენი ორგანიზმი კბილებს და ძვლებს ართმევს და სხვაგან იყენებს, ამის შედეგად ძვლები სუსტდება. რეკომენდირებული კალციუმის რაოდენობა განისაზღვრება ასაკით და სქესით.
    #n
    ქალები 50 წლის ქვემოთ: #st 1,000 მგ #st #n
    კაცები 70 წლის ქვემოთ: #st 1,000 მგ #st #n
    ქალები 50 წლის ზემოთ: #st 1,200 მგ #st #n
    კაცები 70 წლის ზემოთ: #st 1,200 მგ #st #n
    `,
    foods: [
      {
        name: "პარმეზანი",
        elem: 242,
        g: 28,
      },
      { name: "სეზამის მარცვლები", elem: 70, g: 9 },
      { name: "ნუში", elem: 60, g: 28 },
      { name: "თხის რძე", elem: 327, g: 237 },
      { name: "ძროხის რძე", elem: 310, g: 237 },
    ],
  },
  {
    name: "sodium",
    text: `ნატრიუმი იმის მიუხედავად, რომ ჯანმრთელობისთვის აუცილებელია, მისი გადაჭარბებული მიღება ზრდის არტერიულ წნევას. ორგანიზმს დაახლოებით 186 მგ ნატრიუმი ესაჭიროება ფუნქციონირებისთვის, მაგრამ ჩვენ ასეთი ცოტა ნატრიუმის მიღებას ვერ შევძლებთ ისე, რომ საკმარისი ენერგია მივიღოთ. ამიტომ, ყოველდღიური ნატრიუმის ნორმაა 1500მგ და რეკომენდირებულია, რომ არ მივიღოთ 2,300 მგ-ზე მეტი`,
    foods: [
      {
        name: "სუფრის მარილი",
        elem: 38700,
        g: 100,
      },
    ],
  },
  {
    name: "phosphorus",
    text: "ფოსფორს ორგანიზმი იყენებს ძვლებისთვის, ენერგიის წარმოქმნის და ახალი უჯრედების შესაქმნელად. ზრდასრულებისთვის ყოველდღიური ნორმაა #st 700მგ#st, მაგრამ ორსულ ქალებს და მოზარდებს მეტი სჭირდებათ. ფოსფორის გადაჭარბებული მიღება ჯანმრთელობისთვის საზიანოა.",
    foods: [
      {
        name: "მზესუმზირა",
        elem: 315,
        g: 28,
      },
      {
        name: "ღორის ხორცი",
        elem: 200,
        g: 85,
      },
      {
        name: "ქათამი (შემწვარი)",
        elem: 300,
        g: 140,
      },
      {
        name: "ლობიო",
        elem: 250,
        g: 165,
      },

      {
        name: "რძე",
        elem: 245,
        g: 245,
      },
      {
        name: "ორაგული",
        elem: 274,
        g: 280,
      },
      {
        name: "ბრინჯი",
        elem: 162,
        g: 194,
      },
    ],
  },
  {
    name: "iodine",
    text: "იოდს ფარისებრი ჯირკვალი იყენებს, რომ წარმოქნას ჰორმონები. იოდის რეკომენდირებული დღიური რაოდენობაა #st 150მკგ#st. იოდის ნაკლებობამ შეიძლება გამოიწვიოს ფარისებრი ჯირკვლის ზრდა და ჰიპოთირეოზი, რაც იწვევს კუნთების დასუსტებას და წონაში მატებას.",
    foods: [
      {
        name: "რძე",
        elem: 88,
        g: 227,
      },
      {
        name: "კვერცხი",
        elem: 24,
        g: 65,
      },
      {
        name: "თინუსი",
        elem: 17,
        g: 85,
      },
    ],
  },
]);
export default data;
